In [3]:
import numpy as np
import pandas as pd

In [4]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

In [5]:
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [6]:
pd.Series(data=my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [8]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [9]:
ser1 = pd.Series([1,2,3],['Tommy','Tom','Jack'])

In [10]:
ser1

Tommy    1
Tom      2
Jack     3
dtype: int64

In [11]:
ser2 = pd.Series([3,2,4],['Jack','Tommy','Kitty'])

In [12]:
ser2

Jack     3
Tommy    2
Kitty    4
dtype: int64

In [16]:
ser1+ser2

Jack     6.0
Kitty    NaN
Tom      NaN
Tommy    3.0
dtype: float64

In [17]:
from numpy.random import randn

In [18]:
np.random.seed(101)

In [19]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [20]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [21]:
df[['X','Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
C  0.740122  0.528813
D -0.758872 -0.933237
E  1.978757  2.605967

In [23]:
df['new'] = df['X'] + df['Y']

In [27]:
df['newnew'] = [1,2,3,4,'d']

In [28]:
df

          W         X         Y         Z       new newnew
A  2.706850  0.628133  0.907969  0.503826  1.536102      1
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395      2
C -2.018168  0.740122  0.528813 -0.589001  1.268936      3
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109      4
E  0.190794  1.978757  2.605967  0.683509  4.584725      d

In [34]:
df.drop('new',axis=1,inplace=True)

In [35]:
df

          W         X         Y         Z newnew
A  2.706850  0.628133  0.907969  0.503826      1
B  0.651118 -0.319318 -0.848077  0.605965      2
C -2.018168  0.740122  0.528813 -0.589001      3
D  0.188695 -0.758872 -0.933237  0.955057      4
E  0.190794  1.978757  2.605967  0.683509      d

In [41]:
df.iloc[0]

W          2.70685
X         0.628133
Y         0.907969
Z         0.503826
newnew           1
Name: A, dtype: object

In [42]:
df.loc['A']['Y']

0.9079694464765431

In [44]:
df.loc[['A','C'],['X','Z']]

          X         Z
A  0.628133  0.503826
C  0.740122 -0.589001

In [45]:
df > 0

       W      X      Y      Z  newnew
A   True   True   True   True    True
B   True  False  False   True    True
C  False   True   True  False    True
D   True  False  False   True    True
E   True   True   True   True    True

In [46]:
booldf = df > 0

In [47]:
booldf

       W      X      Y      Z  newnew
A   True   True   True   True    True
B   True  False  False   True    True
C  False   True   True  False    True
D   True  False  False   True    True
E   True   True   True   True    True

In [48]:
df[booldf]

          W         X         Y         Z newnew
A  2.706850  0.628133  0.907969  0.503826      1
B  0.651118       NaN       NaN  0.605965      2
C       NaN  0.740122  0.528813       NaN      3
D  0.188695       NaN       NaN  0.955057      4
E  0.190794  1.978757  2.605967  0.683509      d

In [50]:
newind = "NY OR AA BB CC".split()

In [51]:
newind

['NY', 'OR', 'AA', 'BB', 'CC']

In [52]:
df['States'] = newind

In [53]:
df

          W         X         Y         Z newnew States
A  2.706850  0.628133  0.907969  0.503826      1     NY
B  0.651118 -0.319318 -0.848077  0.605965      2     OR
C -2.018168  0.740122  0.528813 -0.589001      3     AA
D  0.188695 -0.758872 -0.933237  0.955057      4     BB
E  0.190794  1.978757  2.605967  0.683509      d     CC

In [54]:
df.set_index("States")

               W         X         Y         Z newnew
States
NY      2.706850  0.628133  0.907969  0.503826      1
OR      0.651118 -0.319318 -0.848077  0.605965      2
AA     -2.018168  0.740122  0.528813 -0.589001      3
BB      0.188695 -0.758872 -0.933237  0.955057      4
CC      0.190794  1.978757  2.605967  0.683509      d